HELLO_TEXT = r"""
Привет! Давай начнем. Выбери метод:"""

INPUT_FUNCTION = r"""
Отлично! Теперь введи функцию. Есть одно строгое правило: имена переменных в функции должны быть вида 
x1, x2, x3, ...  и так далее."""

INPUT_GRADIENT = r"""
Супер! Теперь введи градиент функции. Элементы вектора градиента необходимо отделять друг от друга
тоской с запятой (';'). Можешь оставить это поле пустым, если хочешь 
чтобы мы сами считали градиент (численно).
И не забывай, что именна переменных могут быть только вида x1, x2, x3 ...
<br>
Пример: x1**2+2*x2;x2**2+x1*2"""

INPUT_POINT_LESS_TNEN_3 = r"""
Еще немного! Введи координаты точки, в которой будет стартовать алгоритм. Когда закончишь, нажми кнопку 'Подтвердить'"""

INPUT_POINT = r"""
Еще немного! Введи координаты точки, разделяя их точкой с запятой (';'). """

CONST_GRAD = r"""
И последнее: вот тут есть остальные параметры. Можешь поменять их, а можешь оставить как есть."""